app/controllers/api/weapons_controller.rb

    def index
        @weapons = Weapon.all
---
SELECT "weapons".* FROM "weapons"